app/views/movies/index.html.haml

SELECT "movies".* FROM "movies" WHERE (ratings = 'ratings') ORDER BY title
---
    %tr
      %th{:class => ("hilite" if @sort == "title")}= link_to "Movie Title", sort_path(:ratings.select{|k,v| v==1}.keys, 'title'), :id => "title_header"