app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (ratings = 'ratings') ORDER BY title
---
  def index
    if params[:sort_field]
      then
        @sort = params[:sort_field]
        @movies = Movie.order(params[:sort_field])